In [1]:
import numpy as np
import pandas as pd

In [23]:
rows = ['X','Y','Z']

cols = ['A', 'B', 'C', 'D', 'E']

data = np.round(np.random.randn(3,5),2)

In [24]:
df = pd.DataFrame(data, rows, cols)
df

      A     B     C     D     E
X -0.53 -0.32 -0.02  0.60  0.85
Y -0.97 -0.41  0.38 -0.44 -0.30
Z  0.52  0.46  2.18 -0.94  0.65

In [25]:
df > 0.5

       A      B      C      D      E
X  False  False  False   True   True
Y  False  False  False  False  False
Z   True  False   True  False   True

In [26]:
df[df > 0.5]

      A   B     C    D     E
X   NaN NaN   NaN  0.6  0.85
Y   NaN NaN   NaN  NaN   NaN
Z  0.52 NaN  2.18  NaN  0.65

In [27]:
df['C'] < 1

X     True
Y     True
Z    False
Name: C, dtype: bool

In [28]:
df[df['C'] < 1]

      A     B     C     D     E
X -0.53 -0.32 -0.02  0.60  0.85
Y -0.97 -0.41  0.38 -0.44 -0.30

In [29]:
df = pd.DataFrame(np.array([[1, 5, 1],[2, np.nan, 2],[np.nan, np.nan, 3]]))

df.columns = ['A', 'B', 'C']

df

     A    B    C
0  1.0  5.0  1.0
1  2.0  NaN  2.0
2  NaN  NaN  3.0

In [30]:
df.fillna('?')

     A    B    C
0  1.0  5.0  1.0
1  2.0    ?  2.0
2    ?    ?  3.0

In [35]:
df['A'].fillna(df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [36]:
df.fillna(df['A'].mean())

     A    B    C
0  1.0  5.0  1.0
1  2.0  1.5  2.0
2  1.5  1.5  3.0

In [34]:
df

     A    B    C
0  1.0  5.0  1.0
1  2.0  NaN  2.0
2  NaN  NaN  3.0

In [37]:
df = pd.DataFrame([ ['Google', 'Sam', 200],

                    ['Google', 'Charlie', 120],

                    ['Salesforce','Ralph', 125],

                    ['Salesforce','Emily', 250],

                    ['Adobe','Rosalynn', 150],

                    ['Adobe','Chelsea', 500]])

df.columns = ['Organization', 'Salesperson Name', 'Sales']

df

  Organization Salesperson Name  Sales
0       Google              Sam    200
1       Google          Charlie    120
2   Salesforce            Ralph    125
3   Salesforce            Emily    250
4        Adobe         Rosalynn    150
5        Adobe          Chelsea    500

In [38]:
df.groupby('Organization').count()

              Salesperson Name  Sales
Organization
Adobe                        2      2
Google                       2      2
Salesforce                   2      2

In [39]:
df.groupby('Organization').max()

             Salesperson Name  Sales
Organization
Adobe                Rosalynn    500
Google                    Sam    200
Salesforce              Ralph    250

In [42]:
df.groupby('Organization').min()

             Salesperson Name  Sales
Organization
Adobe                 Chelsea    150
Google                Charlie    120
Salesforce              Emily    125

In [43]:
df.groupby('Organization').Sales.min()

Organization
Adobe         150
Google        120
Salesforce    125
Name: Sales, dtype: int64

In [44]:
df.groupby('Organization').describe()

             Sales
             count   mean         std    min     25%    50%     75%    max
Organization
Adobe          2.0  325.0  247.487373  150.0  237.50  325.0  412.50  500.0
Google         2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
Salesforce     2.0  187.5   88.388348  125.0  156.25  187.5  218.75  250.0

In [45]:
leftDataFrame = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],

                     'A': ['A0', 'A1', 'A2', 'A3'],

                     'B': ['B0', 'B1', 'B2', 'B3']})

   

rightDataFrame = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],

                          'C': ['C0', 'C1', 'C2', 'C3'],

                          'D': ['D0', 'D1', 'D2', 'D3']})  

leftDataFrame, rightDataFrame

(  key   A   B
 0  K0  A0  B0
 1  K1  A1  B1
 2  K2  A2  B2
 3  K3  A3  B3,
   key   C   D
 0  K0  C0  D0
 1  K1  C1  D1
 2  K2  C2  D2
 3  K3  C3  D3)

In [46]:
pd.merge(leftDataFrame, rightDataFrame, how='inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [47]:
leftDataFrame = pd.DataFrame({  'A': ['A0', 'A1', 'A2', 'A3'],

                                'B': ['B0', 'B1', 'B2', 'B3']},

                                index =['K0', 'K1', 'K2', 'K3'])

   

rightDataFrame = pd.DataFrame({ 'C': ['C0', 'C1', 'C2', 'C3'],

                                'D': ['D0', 'D1', 'D2', 'D3']},

                                index = ['K0', 'K1', 'K2', 'K3']) 
leftDataFrame, rightDataFrame

(     A   B
 K0  A0  B0
 K1  A1  B1
 K2  A2  B2
 K3  A3  B3,
      C   D
 K0  C0  D0
 K1  C1  D1
 K2  C2  D2
 K3  C3  D3)

In [48]:
leftDataFrame.join(rightDataFrame)

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2
K3  A3  B3  C3  D3

In [49]:
df = pd.DataFrame({'col1':['A','B','C','D'],

                   'col2':[2,7,3,7],

                   'col3':['fgh','rty','asd','qwe']})
df

  col1  col2 col3
0    A     2  fgh
1    B     7  rty
2    C     3  asd
3    D     7  qwe

In [53]:
df.col2.unique()

array([2, 7, 3], dtype=int64)

In [56]:
df.col2.nunique(), len(df.col2.unique())

(3, 3)

In [57]:
def exponentify(x):
    return x**x

df['col2'].apply(exponentify)

0         4
1    823543
2        27
3    823543
Name: col2, dtype: int64

In [63]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [65]:
df['col2'].apply(lambda x: len(str(x)))

0    1
1    1
2    1
3    1
Name: col2, dtype: int64